Revit.Elements.AdaptiveComponent.UpdatePlacementPoints(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.XYZ[])
Update the placement points of the adaptive component instance to the given points
fi:
pnts: